app/controllers/photos_controller.rb

  def create
   params[:photo][:category_id] = params[:category_id]
   params[:photo][:user_id] = current_user.id
   @photo = Photo.create(photo_params)
---
INSERT INTO "photos" ("user_id", "category_id", "name", "created_at", "updated_at", "photo") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 8], ["category_id", 1], ["name", "Test photo"], ["created_at", "2017-11-27 15:09:22.711992"], ["updated_at", "2017-11-27 15:09:22.711992"], ["photo", "github-mark.png"]]